cmsis-svd/cmsis-svd/data/Spansion/MB9BF41xR_svd.xml
        <!-- REGISTER "PFR4" -->
        <register>
          <name>PFR4</name>
          <description>Port function setting register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P4E" -->
            <field>
              <name>P4E</name>
              <description>Bit14 of PFR4</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4D" -->
            <field>
              <name>P4D</name>
              <description>Bit13 of PFR4</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4C" -->
            <field>
              <name>P4C</name>
              <description>Bit12 of PFR4</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4B" -->
            <field>
              <name>P4B</name>
              <description>Bit11 of PFR4</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4A" -->
            <field>
              <name>P4A</name>
              <description>Bit10 of PFR4</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P49" -->
            <field>
              <name>P49</name>
              <description>Bit9 of PFR4</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P48" -->
            <field>
              <name>P48</name>
              <description>Bit8 of PFR4</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P47" -->
            <field>
              <name>P47</name>
              <description>Bit7 of PFR4</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P46" -->
            <field>
              <name>P46</name>
              <description>Bit6 of PFR4</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P45" -->
            <field>
              <name>P45</name>
              <description>Bit5 of PFR4</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P44" -->
            <field>
              <name>P44</name>
              <description>Bit4 of PFR4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P43" -->
            <field>
              <name>P43</name>
              <description>Bit3 of PFR4</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P42" -->
            <field>
              <name>P42</name>
              <description>Bit2 of PFR4</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P41" -->
            <field>
              <name>P41</name>
              <description>Bit1 of PFR4</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P40" -->
            <field>
              <name>P40</name>
              <description>Bit0 of PFR4</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR5" -->
        <register>
          <name>PFR5</name>
          <description>Port function setting register 5</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P5B" -->
            <field>
              <name>P5B</name>
              <description>Bit11 of PFR5</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5A" -->
            <field>
              <name>P5A</name>
              <description>Bit10 of PFR5</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P59" -->
            <field>
              <name>P59</name>
              <description>Bit9 of PFR5</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P58" -->
            <field>
              <name>P58</name>
              <description>Bit8 of PFR5</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P57" -->
            <field>
              <name>P57</name>
              <description>Bit7 of PFR5</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P56" -->
            <field>
              <name>P56</name>
              <description>Bit6 of PFR5</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P55" -->
            <field>
              <name>P55</name>
              <description>Bit5 of PFR5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P54" -->
            <field>
              <name>P54</name>
              <description>Bit4 of PFR5</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P53" -->
            <field>
              <name>P53</name>
              <description>Bit3 of PFR5</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P52" -->
            <field>
              <name>P52</name>
              <description>Bit2 of PFR5</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P51" -->
            <field>
              <name>P51</name>
              <description>Bit1 of PFR5</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P50" -->
            <field>
              <name>P50</name>
              <description>Bit0 of PFR5</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR6" -->
        <register>
          <name>PFR6</name>
          <description>Port function setting register 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P68" -->
            <field>
              <name>P68</name>
              <description>Bit8 of PFR6</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P67" -->
            <field>
              <name>P67</name>
              <description>Bit7 of PFR6</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P66" -->
            <field>
              <name>P66</name>
              <description>Bit6 of PFR6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P65" -->
            <field>
              <name>P65</name>
              <description>Bit5 of PFR6</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P64" -->
            <field>
              <name>P64</name>
              <description>Bit4 of PFR6</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P63" -->
            <field>
              <name>P63</name>
              <description>Bit3 of PFR6</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P62" -->
            <field>
              <name>P62</name>
              <description>Bit2 of PFR6</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P61" -->
            <field>
              <name>P61</name>
              <description>Bit1 of PFR6</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P60" -->
            <field>
              <name>P60</name>
              <description>Bit0 of PFR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
